demo/FSIBeam_interFSIFoam_2206/sub-iter_5/caseTest/caseSetup/fluidDomain/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    interface
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    top
    {
        type            slip;
        value           uniform (0.0 0.0 0.0);
    }
    left
    {
        type            slip;
        value           uniform (0.0 0.0 0.0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
